//RE9BA8      JOB
/*
/* SET OUTFILE DD NAME TO MATCH YOUR ASSIGN NAME FOR FILE
/* SET LRECL ??? FOR OUTFILE TO MATCH YOUR OUTPUT RECORD SIZE
/*
//A8R        EXEC PGM=A8SL
//STEPLIB      DD DSN=KC03E9B.DCMAFD01.COBOL.LOADLIB,
//    DISP=SHR
//INFILE       DD DSN=KC03E9B.DCMAFD01.A7.SL.DAT,
//    DISP=SHR
//OUTFILE       DD DSN=KC03E9B.DCMAFD01.A8.RPT.OUT,
//    DISP=(NEW,CATLG,DELETE),
//    SPACE=(TRK,(2,1)),
//    RECFM=F,
//    LRECL=190
/*