//RE9BA9      JOB
/*
/* SET OUTFILE DD NAME TO MATCH YOUR ASSIGN NAME FOR FILE
/* SET LRECL ??? FOR OUTFILE TO MATCH YOUR OUTPUT RECORD SIZE
/*
//A9R        EXEC PGM=A9RET
//STEPLIB      DD DSN=KC03E9B.DCMAFD01.COBOL.LOADLIB,
//    DISP=SHR
//INFILE       DD DSN=KC03E9B.DCMAFD01.A7.RET.DAT,
//    DISP=SHR
//OUTFILE       DD DSN=KC03E9B.DCMAFD01.A9.RPT.OUT,
//    DISP=(NEW,CATLG,DELETE),
//    SPACE=(TRK,(2,1)),
//    RECFM=F,
//    LRECL=190
/*